Repository: DanielFiller30/ScriptManager
Catalog: ScriptManager/Localizable.xcstrings
Source language: en
Languages: de

source: %@ result
de: %@ Ergebnis

source: %@ results
de: %@ Ergebnisse

# add
source: Add Script/ Tag
de: Skript/ Kategorie hinzufügen

# add-new-script
source: Add a new script
de: Neues Skript hinzufügen

# add-new-tag
source: Add a new tag
de: Neue Kategorie hinzufügen

# add-script-info
source: Add a new script that you can then execute using your saved list.
de: Füge ein neues Skript hinzu, dass du anschließend über deine gespeicherte Liste ausführen kannst.

# add-script-tag-instruction
source: Use the plus button to create new tags or scripts to get started with the ScriptManager
de: Erstelle über das Plus neue Tags oder Skripte um mit dem ScriptManager loszulegen

# add-tag-info
source: Add a new category to organize your saved scripts.
de: Füge eine neue Kategorie hinzu, um deine gespeicherten Skripte zu organisieren.

source: Archive
de: Archiv

# button-delete
source: Delete script
de: Skript löschen

# button-edit
source: Modify script
de: Skript anpassen

# button-interrupt
source: Interrupt
de: Skript abbrechen

# button-logs
source: Open logs
de: Protokolle öffnen

# button-monitor
source: Show output
de: Ausgabe anzeigen

source: Calculator
de: Taschenrechner

source: Cancel
de: Abbrechen

source: Clean Desktop
de: Schreibtisch aufräumen

# close-alert
source: Cancel
de: Abbrechen

# close-app-btn
source: Terminate
de: Beenden

# close-app-msg
source: Are you sure to terminate your script-manager?
de: Bist du sicher, dass du deinen Skript-Manager beenden möchtest?

# close-app-title
source: Terminate application
de: Beenden

source: Close window
de: Fenster schließen

# color-add-tag
source: Color
de: Farbe der Kategorie

# command
source: Script-command
de: Skript-Befehl

source: Copy Error
de: Fehler kopieren

# creator
source: Developer - Daniel Filler
de: Entwickler - Daniel Filler

# creator-info
source: As an iOS / macOS developer, I develop creative solutions to make your everyday work easier.
de: Als iOS- / macOS-Entwickler erstelle ich kreative Lösungen um deinen Arbeitsalltag zu erleichtern.

source: Data exported
de: Daten exportiert

source: Delete
de: Löschen

# delete-msg
source: Are you sure to remove this script from your list?
de: Bist du sicher, dass du dieses Skript aus deiner Liste entfernen möchtest?

# delete-tag-msg
source: Are you sure to remove the selected tag?
de: Bist du sicher, dass du die ausgewählte Kategorie löschen möchtest?

# delete-tag-title
source: Delete tag
de: Kategorie löschen

# delete-title
source: Remove script
de: Verwerfen

# edit-save
source: Save changes
de: Speichern

# edit-script-title
source: Edit script
de: Skript anpassen

# empty-scripts
source: Add a new script, to run it here
de: Du hast noch keine Skripte gespeichert. Füge ein neues Skript deiner Liste hinzu, um es auszuführen

# empty-scripts-filter
source: You have set an active filter for which you have not saved any matching scripts. Remove your filter to display all scripts
de: Du hast einen aktiven Filter gesetzt, für den du keine passenden Skripte gespeichert hast. Entferne deinen Filter um alle Skripte anzuzeigen

# empty-scripts-search
source: No scripts found for your active search. Clear your search to show all scripts
de: Keine Skripte zu deiner aktiven Suche gefunden. Lösche deine Suche um alle Skripte anzuzeigen

source: Errors
de: Fehler

# export-data
source: Export
de: Exportieren

# export-info
source: Export your user data as a backup file to import it again later
de: Exportiere deine Benutzerdaten als Backup-Datei, um sie später wieder zu importieren

# extras-info
source: Many other features await you in your script manager
de: Viele weitere Features erwarten Dich bei deinem Skript-Manager

source: Failed
de: Fehlgeschlagen

source: Failed (Logs)
de: Fehlgeschlagen (Logs)

source: Favorites
de: Favoriten

source: Files
de: Dateien

# hint-copied
source: Copied to clipboard
de: In die Zwischenablage kopiert

# hint-notifications-text
source: When you activate notifications, you will get a push-up information when your running script has finished.
de: Wenn du die Mitteilungen aktiviert hast, wirst du automatisch über Push-up Mitteilungen darüber informiert, ob dein Skript erfolgreich durchgelaufen ist.

# hint-notifications-title
source: Notifications
de: Mitteilungen

# hint-profile-text
source: If you are using a profile configuration for your shell then change your path to your profile file.
de: Falls du eine Profilkonfiguration für deine Shell verwendest, passe den Pfad zu dieser Datei an.

# hint-profile-title
source: Profile
de: Profil

# hint-remove-tag
source: Remove active tag
de: Aktive Kategorie löschen

# hint-script-text
source: Pleace notice that your script is running out of your root folder. Du kannst jeden beliebigen Befehl ausführen. Bei einer Folge von Befehlen, beachte, dass diese durhc ein ';' getrennt werden müssen.
de: Beachte dass du dich im Root-Verzeichnis deines Macs befindest. Du kannst jeden beliebigen Befehl ausführen. Bei einer Folge von Befehlen, beachte, dass diese durch ein ';' getrennt werden müssen.

# hint-script-title
source: Script
de: Skript

# hint-shell-text
source: You can change your default type of shell. Use the type of shell you use in your terminal as well.
de: Du hast die Möglichkeit deine Standard-Shell zu ändern. Nutze bestmöglichst die Shell, die du in deinem Terminal auch verwendest.

# hint-shell-title
source: Shell-Type
de: Shell-Typ

source: Icons
de: Symbole

source: Import data
de: Daten importieren

# import-info
source: You can import a backup file of the ScriptManager. Please note that a restart is necessary afterwards
de: Du kannst eine Backup Datei des ScriptManagers importieren. Beachte, dass anschließend ein Neustart notwendig ist

# import-restart
source: In order for your imported data to be loaded, you must restart the ScriptManager
de: Damit deine importierten Daten geladen werden, musst du den ScriptManager neustarten

# import-successfull
source: Import successful
de: Import erfolgreich

# input-script
source: Script input
de: Skript-Input

# instructions-title
source: Instructions
de: Anleitung

source: Interrupted
de: Abgebrochen

# last-run
source: Last executed:
de: Zuletzt ausgeführt:

# logging
source: Error logs
de: Fehlerprotokolle

# name-add-script
source: Name for the script
de: Skriptname

# name-add-tag
source: Name of tag
de: Kategoriename

# notification-failed-subtitle
source: Your script failed. Please check the error in your menu-bar application. Hint: Activate logging in your settings, to get further information for your error.
de: Dein Skript konnte nicht erfolgreich ausgeführt werden. Hinweis: Aktiviere das Logging in den Einstellungen, um mehr Informationen zu deinem Fehler zu erhalten.

# notification-failed-title %@
source: Skript '%@' failed
de: Skript '%@' fehlgeschlagen

# notification-info
source: Receive a notification as soon as your scripts have been executed
de: Werde über eine Mitteilung informiert, sobald Deine Skripte ausgeführt wurden

# notification-start-subtitle
source: Your script was called by a keyboard shortcut and is now running.
de: Dein Skript wurde durch einen Tastatur-Kurzbefehl ausgelöst und wird gerade ausgeführt.

# notification-start-title %@
source: Script '%@' is running
de: Skript '%@' wird ausgeführt

# notification-successfull-subtitle
source: Your script has successfully finished. Run an other script in your menu-bar application.
de: Dein Skript wurde erfolgreich durchgeführt. Führe ein weiteres Skript über die Verwaltungsoberfläche aus.

# notification-successfull-title %@
source: Script '%@' successfull finished
de: Skript '%@' abgeschlossen

source: Oops, something went wrong
de: Ups, da ist etwas schief gelaufen

source: Open file
de: Datei öffnen

source: Output
de: Ausgabe

# path
source: Command:
de: Befehl:

# path-add-script
source: Script to execute
de: Skript

# path-logs
source: Path for logs
de: Pfad zu den Protokollen:

# path-profile
source: Path to profile
de: Pfad zum Profil

# path-shell
source: Path to shell
de: Pfad zur Shell

# play-instruction
source: You can run your scripts with output or in the background
de: Du kannst deine Skripte mit Ausgabe oder im Hintergrund ausführen

# presets
source: Templates
de: Vorlagen

# presets-info
source: Use templates and customize them
de: Nutze Vorlagen und passe sie an

source: Remove filter
de: Filter entfernen

# remove-search
source: Clear search
de: Suche löschen

# restart
source: Terminate Application
de: Anwendung beenden

# save-script
source: Save
de: Speichern

# save-tag
source: Save new tag
de: Speichern

# saved %@
source: Saved scripts (%@)
de: Gespeicherte Skripte (%@)

source: Script details
de: Skript-Details

# script-details-info
source: Information for you script
de: Informationen zu deinem Script

# script-run
source: Start without output
de: Ohne Ausgabe starten

# script-run-output
source: Start and show output
de: Mit Ausgabe starten

# scriptmanager-info
source: ScriptManager is a simply designed tool to make your daily work easier. The tool is an open source application and is constantly being developed further. If you have any problems, you can easily create an issue on GitHub.
de: Der ScriptManager ist ein einfach gestaltetes Tool, um deine tägliche Arbeit zu erleichtern. Das Tool ist eine Open-Source-Anwendung und wird stetig weiterentwickelt. Bei Problemen kannst du ganz einfach ein Issue auf GitHub erstellen.

# scripts-details-info
source: Gain insight into the details of your scripts
de: Erhalte Einblick in die Details deiner Skripte

# scripts-info
source: Create scripts and save them in your list for faster execution
de: Erstelle Skripte und speichere sie in Deiner Liste für ein schnelleres Ausführen

# search-script-name
source: Search for script
de: Suche nach Skript

source: Settings
de: Einstellungen

# settings-autostart
source: Launch at login
de: Bei der Anmeldung öffnen

# settings-delete-msg
source: Are you sure you want to delete your saved settings?
de: Bist du dir sicher, dass du deine gespeicherten Einstellungen löschen möchtest?

# settings-delete-title
source: Delete settings
de: Einstellungen löschen

# settings-instruction
source: You can use the cogwheel to define your settings to tailor the Script Manager to your requirements
de: Über das Zahnrad kannst du deine Einstellungen festlegen, um den Skript-Manager deinen Anforderungen zuzuschneiden

# settings-logging
source: Activate error-logs
de: Fehler-Protokoll aktivieren

# settings-notifications
source: Activate notifications
de: Mitteilungen aktivieren

# settings-save
source: Save settings
de: Einstellungen speichern

# settings-shell
source: Shell-settings
de: Terminal-Einstellungen

# settings-shortcut
source: Modify shortcuts
de: Tastenkurzbefehle festlegen

source: Shell-type
de: Shell-Typ

# shortcut-title
source: Shortcut:
de: Kurzbefehl:

# shortcuts-info
source: Use keyboard shortcuts to execute your scripts from anywhere
de: Nutze Tastatur-Kurzbefehle um deine Skripte von überall auszuführen

# states-title
source: Script result
de: Skript-Ergebnis

# success
source: Successful
de: Erfolgreich

# tag-script
source: tag
de: Kategorie

# tags-info
source: Use tags to better organize your scripts
de: Nutze Tags um deine Skripte besser zu organisieren

# test-failed
source: Script failed
de: Skript fehlerhaft

# test-script
source: Test
de: Testen

# test-success
source: Script worked
de: Erfolgreich getestet

source: User input
de: Benutzereingabe

# welcome-close
source: Close window
de: Loslegen

# welcome-info
source: You can open your Script-Manager with the menubar symbol of your Mac. Before you add your first script, please have a look in your settings, they are important to offer that your scripts run successfully.
de: Du kannst deinen Skript-Manager über das neue Symbol in der Menubar deines Macs öffnen. Bevor du loslegst, solltest du einen Blick in deine Einstellungen werfen, die benötigt werden, um deine Skripte zum laufen zu bringen.

# welcome-title
source: Welcome to your personal Script-Manager
de: Herzlich Willkommen zu deinem persönlichen Skript-Manager

# welcome-toggle
source: Don't show again
de: Nicht mehr anzeigen
